package com.haisheng.framework.testng.bigScreen.jiaochen.mc.tool;

public class FastContent {
    public static final String NAME51 = "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌";
    public static final String NAME50 = "赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦?41aB[&(_*>";
    public static final String CONTENT1000 = "党史学习教育动员大会2月20日上午在北京召开。习近平总书记强调，全党同志要做到学史明理、学史增信、学史崇德、学史力行，" +
            "学党史、悟思想、办实事、开新局，以昂扬姿态奋力开启全面建设社会主义现代化国家新征程，以优异成绩迎接建党一百周年。风雨苍黄百年路，高歌奋进新征程。" +
            "习近平总书记为这场学习教育“开课”，为党员干部如何学好学深党史指明了方向。作为党员干部，我们要从党史学习教育中汲取智慧力量，认真回顾走过的路，" +
            "永远不忘来时的路，继续走好前行的路，守住自己的那份“初心”，始终做到与党同心、与民贴心、让民放心。学习党的奋斗史，从中汲取前行力量，做到与党同心。" +
            "100年来，中国共产党历经风霜，带领全国人民经历了28年的浴血奋战，取得了新民主主义革命的胜利，建立了社会主义新中国；经过30年社会主义建设的艰辛历程，" +
            "探索出一条适合中国国情的社会主义道路；实行改革开放的伟大决策，我国社会主义建设进入新时期，人民生活基本达到小康水平。进入新时代，作为党员干部，" +
            "更要学好党史，如此才能体会到党史如明灯，照亮前行之路，党史如清泉，洗涤心灵之尘，党史如号角，激励奋进，更加坚定理想信念，锻造革命信仰，保持革命意志，" +
            "发扬伟大斗争精神，走好新的长征路。学习党的成长史，更加坚定理想信念，做到与民贴心。“欲知大道，必先为史。”党员干部要利用空余时间多学习党的成长史，" +
            "记忆“红军不怕远征难”“不到长城非好汉”“雄关漫道真如铁，而今迈步从头越”“而今又踏长征路，山河峥嵘”，懂得“苦不苦，想想长征二万五，累不累，想想革命的老前辈”，" +
            "弘扬“不怕牺牲、前赴后继，勇往直前、坚韧不拔，众志成城、团结互助，百折不挠”的长征精神，坚持以人民为中心的思想，始终牢记为人民服务的宗旨，" +
            "永记张思德“为人民利益而牺牲”的大公无私，焦裕禄“心里装着全体人民、唯独没有他自己”的公仆精神，孔繁森“一腔热血洒高原”的默默付出，" +
            "廖俊波甘做人民“樵夫”的实干作风……始终与民贴心，努力办好为民之事，让人民群众过上更好的日子。学习党的复兴史，永葆干事创业激情，做到让民放心。" +
            "当前，我国正处在实现“两个一百年”奋斗目标的历史交汇期，面对世界百年未有之大变局，党员干部要认真学习复兴路上的宏伟篇章，不断提高政治判断力、" +
            "政治领悟力、政治执行力，谋划好“十四五”开篇布局，始终坚持一手抓疫情防控，一手抓经济发展，始终做到“我将无我，不负人民”，与广大人民群众同呼吸共命运";
    public static final String CONTENT9 = "赵钱孙李周吴郑王冯";
    public static final String CONTENT10 = "赵钱孙李B[&(_*";
    public static final String CONTENT200= "党史学习教育动员大会2月20日上午在北京召开。习近平总书记强调，全党同志要做到学史明理、学史增信、学史崇德、学史力行，" +
            "学党史、悟思想、办实事、开新局，以昂扬姿态奋力开启全面建设社会主义现代化国家新征程，以优异成绩迎接建党一百周年。风雨苍黄百年路，高歌奋进新征程。" +
            "习近平总书记为这场学习教育“开课”，为党员干部如何学好学深党史指明了方向。作为党员干部，我们要从党史学习教育中汲取智慧力量，认真回顾走过。";








}
