package com.haisheng.framework.testng.bigScreen.jiaochen.wm.enumerator;

import lombok.Getter;

public enum EnumDesc {
    DESC_BETWEEN_1_5("1"),

    DESC_BETWEEN_5_10("来自土星的消息"),

    DESC_BETWEEN_10_15("不是价值客户，作废卡券"),

    DESC_BETWEEN_15_20("网线传输能力不足或网络不稳定!!!"),

    DESC_BETWEEN_20_30("使用此卡券可在适用门店享受立减优惠哦~~~"),

    DESC_BETWEEN_30_40("2020马上就要过去，赶快来保养一下爱车吧，开开心心过年！"),

    DESC_BETWEEN_40_50("I hope the new covid-19 epidemic will be over."),

    DESC_BETWEEN_200_300("先帝创业未半而中道崩殂，今天下三分，益州疲弊，此诚危急存亡之秋也。然侍卫之臣不懈于内，忠志之士忘身于外者，盖追先帝之殊遇，欲报之于陛下也。" +
            "诚宜开张圣听，以光先帝遗德，恢弘志士之气，不宜妄自菲薄，引喻失义，以塞忠谏之路也。宫中府中，俱为一体，陟罚臧否，不宜异同。若有作奸犯科及为忠善者，" +
            "宜付有司论其刑赏，以昭陛下平明之理，不宜偏私，使内外异法也。侍中、侍郎郭攸之、费祎、董允等，此皆良实，志虑忠纯，是以先帝简拔以遗陛下。" +
            "愚以为宫中之事，事无大小，悉以咨之，然后施行，必能裨补阙漏，有所广益。"),

    DESC_BETWEEN_400_500("一、准备。保证场地干净整洁，工具齐全，产品液体充足摆放在指定位置。具体内容包括：1、洗手台不允许放置任何物品，除临时放置洗好脚垫；" +
            "2、管子要尽可能在不施工时收起来或盘好；3、所有工具施工完毕后必须收到工具箱，研磨剂等耗材要收到工具车里；4、毛巾按指示归类洗净叠好。\n" +
            "\n" +
            "二、接车。（好胎屋）车主将车开进洗车间时，员工应第一时间上前迎接，面带微笑帮顾客开启车门，并礼貌与顾客打招呼：“您好，欢迎光临！”顾客下车时，提醒顾客带好贵重物品：“请您带好随身贵重物品，谢谢！”保管好钥匙，交给客户对应的钥匙卡。\n" +
            "\n" +
            "三、移车开单。将车辆缓慢移入洗车位，注意安全；认真填写洗车单据，填好后连同钥匙一并交给前台。\n" +
            "\n" +
            "四、检查。仔细检查整车漆面、前大灯，前挡风玻璃、后挡风玻璃、后尾灯是否有损坏或撞伤，如有问题需及时吿知接车员。"),

    DESC_BETWEEN_500_1000("豫章故郡，洪都新府。星分翼轸，地接衡庐。襟三江而带五湖，控蛮荆而引瓯越。物华天宝，龙光射牛斗之墟；人杰地灵，徐孺下陈蕃之榻。" +
            "雄州雾列，俊采星驰。台隍枕夷夏之交，宾主尽东南之美。都督阎公之雅望，棨戟遥临；宇文新州之懿范，襜帷暂驻。十旬休假，胜友如云；千里逢迎，高朋满座。" +
            "腾蛟起凤，孟学士之词宗；紫电青霜，王将军之武库。家君作宰，路出名区；童子何知，躬逢胜饯。时维九月，序属三秋。潦水尽而寒潭清，烟光凝而暮山紫。" +
            "俨骖騑于上路，访风景于崇阿；临帝子之长洲，得天人之旧馆。层峦耸翠，上出重霄；飞阁流丹，下临无地。鹤汀凫渚，穷岛屿之萦回；桂殿兰宫，即冈峦之体势。" +
            "披绣闼，俯雕甍，山原旷其盈视，川泽纡其骇瞩。闾阎扑地，钟鸣鼎食之家；舸舰弥津，青雀黄龙之舳。云销雨霁，彩彻区明。落霞与孤鹜齐飞，秋水共长天一色。" +
            "渔舟唱晚，响穷彭蠡之滨；雁阵惊寒，声断衡阳之浦。遥襟甫畅，逸兴遄飞。爽籁发而清风生，纤歌凝而白云遏。睢园绿竹，气凌彭泽之樽；邺水朱华，光照临川之笔。" +
            "四美具，二难并。穷睇眄于中天，极娱游于暇日。天高地迥，觉宇宙之无穷；兴尽悲来，识盈虚之有数。望长安于日下，目吴会于云间。地势极而南溟深，天柱高而北辰远。" +
            "关山难越，谁悲失路之人？萍水相逢，尽是他乡之客。怀帝阍而不见，奉宣室以何年？嗟乎！时运不齐，命途多舛。冯唐易老，李广难封。屈贾谊于长沙，非无圣主；" +
            "窜梁鸿于海曲，岂乏明时？所赖君子见机，达人知命。老当益壮，宁移白首之心？穷且益坚，不坠青云之志。酌贪泉而觉爽，处涸辙以犹欢。北海虽赊，扶摇可接；" +
            "东隅已逝，桑榆非晚。孟尝高洁，空余报国之情；阮籍猖狂，岂效穷途之哭！勃，三尺微命，一介书生。无路请缨，等终军之弱冠；有怀投笔，慕宗悫之长风。" +
            "舍簪笏于百龄，奉晨昏于万里。非谢家之宝树，接孟氏之芳邻。他日趋庭，叨陪鲤对；今兹捧袂，喜托龙门。杨意不逢，抚凌云而自惜；钟期既遇，奏流水以何惭？" +
            "呜乎！胜地不常，盛筵难再；兰亭已矣，梓泽丘墟。临别赠言，幸承恩于伟饯；登高作赋，是所望于群公。敢竭鄙怀，恭疏短引；一言均赋，四韵俱成。请洒潘江，各倾陆海云尔：\n" +
            "\n" +
            "滕王高阁临江渚，佩玉鸣鸾罢歌舞。\n" +
            "\n" +
            "画栋朝飞南浦云，珠帘暮卷西山雨。\n" +
            "\n" +
            "闲云潭影日悠悠，物换星移几度秋。\n" +
            "\n" +
            "阁中帝子今何在？槛外长江空自流。"),

    DESC_BETWEEN_1000_2000("话说天下大势，分久必合，合久必分。周末七国分争，并入于秦。及秦灭之后，楚、汉分争，又并入于汉。" +
            "汉朝自高祖斩白蛇而起义，一统天下，后来光武中兴，传至献帝，遂分为三国。推其致乱之由，殆始于桓、灵二帝。桓帝禁锢善类，崇信宦官。" +
            "及桓帝崩，灵帝即位，大将军窦武、太傅陈蕃，共相辅佐。时有宦官曹节等弄权，窦武、陈蕃谋诛之，机事不密，反为所害，中涓自此愈横。" +
            "主建宁二年四月望日，帝御温德殿。方升座，殿角狂风骤起。只见一条大青蛇，从梁上飞将下来，蟠于椅上。帝惊倒，左右急救入宫，百官俱奔避。" +
            "须臾，蛇不见了。忽然大雷大雨，加以冰雹，落到半夜方止，坏却房屋无数。建宁四年二月，洛阳地震；又海水泛溢，沿海居民，尽被大浪卷入海中。" +
            "光和元年，雌鸡化雄。六月朔，黑气十余丈，飞入温雄殿中。秋七月，有虹现于玉堂；五原山岸，尽皆崩裂。种种不祥，非止一端。" +
            "帝下诏问群臣以灾异之由，议郎蔡邕上疏，以为霓堕鸡化，乃妇寺干政之所致，言颇切直。帝览奏叹息，因起更衣。曹节在后窃视，悉宣告左右；" +
            "遂以他事陷邕于罪，放归田里。后张让、赵忠、封谞、段珪、曹节、侯览、蹇硕、程旷、夏恽、郭胜十人朋比为奸，号为“十常侍”。" +
            "帝尊信张让，呼为“阿父”。朝政日非，以致天下人心思乱，盗贼蜂起。古时巨鹿郡有兄弟三人，一名张角，一名张宝，一名张梁。" +
            "那张角本是个不第秀才，因入山采药，遇一老人，碧眼童颜，手执藜杖，唤角至一洞中，以天书三卷授之，曰：“此名《太平要术》，汝得之，当代天宣化，普救世人；" +
            "若萌异心，必获恶报。”角拜问姓名。老人曰：“吾乃南华老仙也。”言讫，化阵清风而去。角得此书，晓夜攻习，能呼风唤雨，号为“太平道人”。" +
            "中平元年正月内，疫气流行，张角散施符水，为人治病，自称“大贤良师”。角有徒弟五百余人，云游四方，皆能书符念咒。" +
            "次后徒众日多，角乃立三十六方，大方万余人，小方六七千，各立渠帅，称为将军；讹言：“苍天已死，黄天当立；岁在甲子，天下大吉。" +
            "”令人各以白土，书“甲子”二字于家中大门上。青、幽、徐、冀、荆、扬、兖、豫八州之人，家家侍奉大贤良师张角名字。" +
            "角遣其党马元义，暗赍金帛，结交中涓封谞，以为内应。角与二弟商议曰：“至难得者，民心也。今民心已顺，若不乘势取天下，诚为可惜。" +
            "”遂一面私造黄旗，约期举事；一面使弟子唐周，驰书报封谞。唐周乃径赴省中告变。帝召大将军何进调兵擒马元义，斩之；次收封谞等一干人下狱。" +
            "张角闻知事露，星夜举兵，自称“天公将军”，张宝称“地公将军”，张梁称“人公将军”。申言于众曰：“今汉运将终，大圣人出。" +
            "汝等皆宜顺天从正，以乐太平。”四方百姓，裹黄巾从张角反者四五十万。贼势浩大，官军望风而靡。何进奏帝火速降诏，令各处备御，讨贼立功。" +
            "一面遣中郎将卢植、皇甫嵩、朱俊，各引精兵、分三路讨之。"),
    ;

    EnumDesc(String desc) {
        this.desc = desc;
    }

    @Getter
    private final String desc;
}
